app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 1 ORDER BY created_at DESC
---
def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")

SELECT "listings".* FROM "listings" WHERE "listings"."user" IS NULL ORDER BY created_at DESC
---
  def index
    @listings = Listing.where(user: current_user).order("created_at DESC")

INSERT INTO "listings" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    respond_to do |format|
      if @listing.save