app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" ORDER BY created_at DESC
---
  def index
      @listings = Listing.all.order("created_at DESC")