app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 2 ORDER BY created_at DESC
---
  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 2 ORDER BY created_at DESC
---
  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "orders" ("address", "city", "created_at", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "3203 N. Stevens Ave"], ["city", "Rosemead"], ["created_at", Fri, 02 May 2014 04:29:13 UTC +00:00], ["state", "CA"], ["updated_at", Fri, 02 May 2014 04:29:13 UTC +00:00]]
---
  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    begin
      charge = Stripe::Charge.create(
        :amount => (@listing.price * 100).floor,
        :currency => "usd",
        :card => token
        )